app/Controllers/AdminGudangController.php

SELECT *
FROM `beritaacara`
---
    public function index()
    {
        $modelBeritaAcara = new BeritaAcaraModel();
        $data = [
            'halaman' => 'Dashboard',
            'menu1' => 'selected',
            'menu2' => '',
            'menu3' => '',
            'databeritaacara' => $modelBeritaAcara->findAll()

SELECT *
FROM `beritaacara`
---
    public function index_beritaacara()
    {
        $modelBeritaAcara = new BeritaAcaraModel();
        $data = [
            'halaman' => 'Berita Acara',
            'menu1' => '',
            'menu2' => 'selected',
            'menu3' => '',
            'databeritaacara' => $modelBeritaAcara->findAll()