app/Controllers/AdminKecamatanController.php

    public function create()
    {
        $modelBAST = new BASTModel();
        $data = [
            'halaman' => 'BAST',
            'menu1' => '',
            'menu2' => '',
            'menu3' => 'selected',
            'bast' => $modelBAST->findAll(),
---
SELECT *
FROM `bast`