app/Models/AdminKecamatan.php

    public function getAllAdminKecamatn()
    {
        $query = $this->db->table('adminkecamatan')
            ->select('adminkecamatan.*, user.*')
            ->join('user', 'user.id_user = adminkecamatan.id_user', 'left')
            ->get();
---
SELECT `adminkecamatan`.*, `user`.*
FROM `adminkecamatan`
LEFT JOIN `user` ON `user`.`id_user` = `adminkecamatan`.`id_user`