app/Models/BeritaAcaraModel.php

    public function getAllItemByKode($kode)
    {
        $query = $this->db->table('beritaacara')
            ->select('beritaacara.*, itemberitaacara.*')
            ->join('itemberitaacara', 'itemberitaacara.kodeberitaacara = beritaacara.kode_beritaacara', 'left')
            ->where('itemberitaacara.kodeberitaacara', $kode)
            ->get();
---
SELECT `beritaacara`.*, `itemberitaacara`.*
FROM `beritaacara`
LEFT JOIN `itemberitaacara` ON `itemberitaacara`.`kodeberitaacara` = `beritaacara`.`kode_beritaacara`
WHERE `itemberitaacara`.`kodeberitaacara` = 'BA01122023014402'