app/Models/ItemBeritaAcaraModel.php

    public function getCekStatus()
    {
        $query = $this->db->table('itemberitaacara')
            ->select('itemberitaacara.*')
            ->where('itemberitaacara.status_itemberitaacara', 'Dalam Proses')
            ->get();
---
SELECT `itemberitaacara`.*
FROM `itemberitaacara`
WHERE `itemberitaacara`.`status_itemberitaacara` = 'Dalam Proses'

    public function getAllItemDalamProses()
    {
        $query = $this->db->table('itemberitaacara')
            ->select('itemberitaacara.*')
            ->where('itemberitaacara.status_itemberitaacara', 'Dalam Proses')
            ->get();
---
SELECT `itemberitaacara`.*
FROM `itemberitaacara`
WHERE `itemberitaacara`.`status_itemberitaacara` = 'Dalam Proses'